rollingstone/PIC32-Thermal-Controller/PeripheralSettingsAndMacros.c
    OpenOC1(OC_ON | OC_TIMER2_SRC | OC_PWM_FAULT_PIN_DISABLE, 0, 0); // init OC1 module, T2 =source 
    
//    OpenOC2(OC_ON | OC_TIMER2_SRC | OC_PWM_FAULT_PIN_DISABLE, 0, 0); // init OC2 module, T2 =source(you could do more OCx)
    OpenTimer2(T2_ON | T2_PS_1_1 | T2_SOURCE_INT, val);         // init Timer2 mode and period reg (PR2)

    
//    PR2 = ((int)SYS_FREQ/ (pwm_frequency*256))-1;
    
//    T2CONSET = 0x8000;
//    OC1CONSET = 0x8000;
    
//    printf("PR2 == %d", PR2, OC1RS, OC2RS);

//    SetDCOC1PWM(PWM1_Value);
//    SetDCOC2PWM(PWM2_Value);

//T2_32BIT_MODE_ON

    mT2SetIntPriority(7);  // you don't have to use ipl7, but make sure INT definition is the same as your choice here
    mT2ClearIntFlag();     // make sure no int will be pending until 7200 counts from this point.  
    mT2IntEnable(1);       // allow T2 int
}


void InitTimer1(uint32_t freq)
{
    int freq_val = ((int)SYS_FREQ/ (freq))-1;
    
//    int correct_freq = freq * 
    
    PR1 = (uint32_t)SYS_FREQ/ ((uint32_t)(freq*( (uint32_t)128)) )-1;
    
    T1CONbits.TCKPS = 0b11; // 128
    
    mT1SetIntPriority(3);  // you don't have to use ipl3, but make sure INT definition is the same as your choice here
    mT1ClearIntFlag();     // make sure no int will be pending until 7200 counts from this point.  
    mT1IntEnable(1);       // allow T2 int

    T1CONbits.ON = 1;
}



//void InitPWM()
//{
//    SetDCOC1PWM(3600);
//    
//    INTEnableSystemMultiVectoredInt();         // make separate interrupts possible
// 
//    int samplerate = 100;
// 
//    OpenOC1(OC_ON | OC_TIMER2_SRC | OC_PWM_FAULT_PIN_DISABLE,0,0); // init OC1 module, T2 =source 
//    OpenOC2(OC_ON | OC_TIMER2_SRC | OC_PWM_FAULT_PIN_DISABLE,0,0); // init OC2 module, T2 =source(you could do more OCx)
//    OpenTimer2(T2_ON | T2_PS_1_1 | T2_SOURCE_INT,FPB/samplerate);         // init Timer2 mode and period reg (PR2)
// 
//    PR2 = FPB/samplerate-1;
//
//    mT2SetIntPriority(7);  // you don't have to use ipl7, but make sure INT definition is the same as your choice here
//    mT2ClearIntFlag();     // make sure no int will be pending until 7200 counts from this point.  
//    mT2IntEnable(1);       // allow T2 int
//    
//    
//}





void InitPWM_v2(int sample_rate)
{
    
    PPS_Unlock();
    RPD1Rbits.RPD1R = 0b1100; // OC1
    RPD2Rbits.RPD2R = 0b1011; // OC3
 
    PPS_Lock();
    
//    mPORT
    
    int  samplerate = sample_rate;
    int PR2 = PBUS_CLOCK/samplerate-1;

    OpenOC1(OC_ON | OC_TIMER2_SRC | OC_PWM_FAULT_PIN_DISABLE, 0, 0); // init OC1 module, T2 =source 
    OpenOC2(OC_ON | OC_TIMER2_SRC | OC_PWM_FAULT_PIN_DISABLE, 0, 0); // init OC2 module, T2 =source(you could do more OCx)
    OpenTimer2(T2_ON | T2_PS_1_1 | T2_SOURCE_INT, PBUS_CLOCK/samplerate);         // init Timer2 mode and period reg (PR2)

    SetDCOC1PWM(PWM1_Value);
    SetDCOC2PWM(PWM2_Value);
    
//T2_32BIT_MODE_ON
    

    mT2SetIntPriority(7);  // you don't have to use ipl7, but make sure INT definition is the same as your choice here
    mT2ClearIntFlag();     // make sure no int will be pending until 7200 counts from this point.  
    mT2IntEnable(1);       // allow T2 int
}

void InitSPI1Slave()
{
//    printf("Mapping SPI 1 Slave Pins\n");

    MapSPI1SlavePins();
    
    
    SpiChnEnable(SPI_CHANNEL1, 0);
    SpiChnConfigure(SPI_CHANNEL1, (SpiConfigFlags)(SPI_CONFIG_CKE_REV | SPI_CONFIG_MODE8 | SPI_CONFIG_ON));
    SpiChnEnable(SPI_CHANNEL1, 1);

    SPI1CONbits.ON = 1;
}


void InitSPI2Slave()
{
//    printf("Mapping SPI 2 Slave Pins\n");
    
    MapSPI2SlavePins();
    
    
    SpiChnEnable(SPI_CHANNEL2, 0);
    SpiChnConfigure(SPI_CHANNEL2, (SpiConfigFlags)(SPI_CONFIG_CKE_REV | SPI_CONFIG_MODE8 | SPI_CONFIG_ON));
    SpiChnEnable(SPI_CHANNEL2, 1);

    SPI2CONbits.ON = 1;

}


void InitSPI1(int baud_rate)
{
    MapSPI1MasterPins();
    
    SpiChnConfigure(SPI_CHANNEL1, (SpiConfigFlags)(SPI_CONFIG_MSTEN |   
                                                   SPI_CONFIG_MODE8 | SPI_CONFIG_ON
                                                   ));
    SpiChnSetBrg(SPI_CHANNEL1, baud_rate);
    SpiChnEnable(SPI_CHANNEL1, 1);
}


void InitSPI2(int baud_rate)
{
//    printf("Mapping SPI 2 Master Pins\n");
    MapSPI2MasterPins();
    
    SpiChnConfigure(SPI_CHANNEL2, (SpiConfigFlags)(SPI_CONFIG_MSTEN |  SPI_CONFIG_MSSEN | 
                                                   SPI_CONFIG_MODE8 | SPI_CONFIG_ON |
                                                   0));
    SpiChnSetBrg(SPI_CHANNEL2, baud_rate);
    SpiChnEnable(SPI_CHANNEL2, 1);
}


void SplitFloat2Ints(float fval, int *int_val, int *frac_val)
{
    *int_val = (int) fval;

    *frac_val = (int) ( (float)(fval - (float) *int_val)*1000);
    
//    if(fval >= 0)
//    {
//        *frac_val = (int) ( (float)(fval - (float) *int_val)*1000);
//    }
//    else
//    {
//        *frac_val = (int) ( (float)(-fval + (float) *int_val)*1000);
//    }    
}



uint32_t GetDataBuffer(UART_MODULE id, char *buffer, uint32_t max_size)
{
    uint32_t num_char;

    num_char = 0;

    while(num_char < max_size)
    {
        uint8_t character;

        while(!UARTReceivedDataIsAvailable(id))
            ;
        character = UARTGetDataByte(id);
        if(character == '\r')
            break;
        *buffer = character;
        buffer++;
        num_char++;
    }

    return num_char;
}

void ReadWriteUART2()
{
    int count = 0;
    int data_rx;
    
    int max_buf0_len = 100;
    char buffer0[100];
    int idx = 0;
    
    
//    U2STAbits.URXISEL = 1;
    
//    
//    while(1)
//    {
//        
//        
//        
////        if(DoReadUART2)
//        {
//            int val = ReadUART2();
//            
//            printf("UART2 data %c\n", (char) val);
//        }
//    }
    
//    while(1)
//    {
////        while(DataRdyUART2());
////        while(DataRdyUART2()==0);
//        
//        data_rx = ReadUART2();
////        buffer0[14] = 0;
//            
////        putsUART2(buffer)
////        printf("%-3d:\t received data\t %c", count++, buffer0);
//        printf("%-3d:\t received data\t %c\n", count++, (char)data_rx);
//        
//    }
//    
    
//    UARTStartAutoDataRateDetect(1);
    
    int k = 0;
    char buffer[20];
    while(1)
    {
        
//        while(BusyUART2());
        
        k = 0;
        for(k = 0; k < 10; k++)
        {
    //        while (U2STAbits.UTXBF);
    //        U2TXREG = c;

//            if(UARTDataRateDetected(1) != 0)
            {
    //            int val =  ReadUART2(1);
//                UART_DATA val =  UARTGetData(1);
//                while(BusyUART2());
//                
//                while(DataRdyUART2());

//                while(U2STAbits. == 0);

