rollingstone/PIC32-Thermal-Controller/PeripheralSettingsAndMacros.c
//                while(U2STAbits.URXDA!=0);
                
                while(U2STAbits.URXDA)
                {
                    data_rx = UARTGetDataByte(1);
                    
//                    getsUART2(9, buffer0, 100);
//                    buffer0[9] = 0;
//                    printf("buffer\t %s\n",buffer0);
                    if(idx < max_buf0_len)
                    {
                        buffer0[idx] = data_rx;
                        idx++;

                    }
                    else{
                        
                        idx = 0;
                        int ix = 0;
                        for(ix = 0; ix < max_buf0_len; ix++)
                        {
                            printf("%-d:\tRead UART2 data %d\n", count++, (char)(buffer0[ix]));
                            
//                            U2TXREG = 'M';
//                            while(U2STAbits.UTXBF);
                        }
                        
                    }
                }
            }
        }
        
//        buffer[k]  = 0;

//        printf("%-d:\tRead UART2 data %c\n", count++, data_rx);
        
//        int ix;
//        for(ix = 0; ix < 1; ix++)
//        {
//            while(BusyUART2());
//
////            WriteUART2('V');
//            U2TXREG = 'M';
//            while(U2STAbits.UTXBF);
//
//        }
        
//        printf("%-d:\tRead UART2 data %c\n", count++, (char) val.data8bit);
//                printf("%-d:\tRead UART2 data %c\n", count++, (char) val);

//        WaitMS(1);

    }
    
    
}

BOOL IsDataWaitingUART2()
{
    return U2STAbits.URXDA != 0;
}

BOOL ReadCommandFromUART2(int *command, int length)
{
    /*
     Command is always 3 bytes of information
     * byte 1 : target ID
     * byte 2: 1-> write 0 Read
     * byte 3: byte to be written
     */
    
    int idx = 0;
    
    int k;
    while(U2STAbits.URXDA && (idx < length))
    {
        int val = (int) UARTGetDataByte(1);
        command[idx] = (char) val;
        idx++;
        k = 0; while(k++ < 1000);
        
        printf("Command received %d\n", val);
    }
    
//    U2STAbits.URXDA = 0;
    
    
    int count  = 0;
    if(command[0] > 0 && (command[1] == 0 || command[1] == 1) && idx >= 3)
    {
//        printf("******************************* Sending Acknowledgment ***************************\n");
        
        while(UARTTransmitterIsReady(1) == FALSE);
//        UARTSendDataByte(1 , 0xAA);
//        UARTSendDataByte(1 , 0xAA);
//            WRITE_TO_UART2(0xAA);
//        WRITE_TO_UART2(command[1]);
//        WRITE_TO_UART2(command[2]);
//        
        
//        while(UARTTransmitterIsReady(1) == FALSE);
//        UARTSendDataByte(1, command[0]);
//
//        while(UARTTransmitterIsReady(1) == FALSE);
//        UARTSendDataByte(1, command[1]);
//
//        while(UARTTransmitterIsReady(1) == FALSE);
//        UARTSendDataByte(1, command[2]);
     
        
        return TRUE;
    }
    
    return FALSE;
}


BOOL ReadCommandFromUART1(int *command, int length)
{
    /*
     Command is always 3 bytes of information
     * byte 1 : target ID
     * byte 2: 1-> write 0 Read
     * byte 3: byte to be written
     */
    
    int idx = 0;
    
    int k;
    
    if(!U1STAbits.URXDA)
    {
        return FALSE;
    }
    
    while(U1STAbits.URXDA && (idx < length))
    {
        int val = (int) UARTGetDataByte(0);
        command[idx] = (char) val;
        idx++;
        k = 0; while(k++ < 1000);
        
        printf("Command received %d\n", val);
    }
    
//    U2STAbits.URXDA = 0;
    
    
    int count  = 0;
    if(command[0] > 0 && (command[1] == 0 || command[1] == 1) && idx >= 3)
    {
//        printf("******************************* Sending Acknowledgment ***************************\n");
        
        while(UARTTransmitterIsReady(0) == FALSE);
        return TRUE;
    }
    
    return FALSE;
}

BOOL ReadCommandFromSPI2Slave(int *command, int length)
{
    /*
     Command is always 3 bytes of information
     * byte 1 : target ID
     * byte 2: 1-> write 0 Read
     * byte 3: byte to be written
     */
    
    int idx = 0;
    int dummy = 0;
    
    int k;
    if(SPI2STATbits.SPIRBF)
    {
        while(SPI2STATbits.SPIRBF && (idx < length))
        {
            printf("Reading spi command....\n");
            
            int val = SPI2_SLAVE_READ();
            SPI2_SLAVE_WRITE(val, dummy);
            
            command[idx] = (char) val;
            idx++;
            k = 0; while(k++ < 1000);

            printf("Commane received %d\n", val);
        }
    }
    
//    U2STAbits.URXDA = 0;
    
    
    int count  = 0;
    if(command[0] > 0 && (command[1] == 0 || command[1] == 1) && idx >= 3)
    {
//        printf("******************************* Sending Acknowledgment ***************************\n");
        
        while(UARTTransmitterIsReady(1) == FALSE);
//        UARTSendDataByte(1 , 0xAA);
//        UARTSendDataByte(1 , 0xAA);
//            WRITE_TO_UART2(0xAA);
//        WRITE_TO_UART2(command[1]);
//        WRITE_TO_UART2(command[2]);
//        
        
//        while(UARTTransmitterIsReady(1) == FALSE);
//        UARTSendDataByte(1, command[0]);
//
//        while(UARTTransmitterIsReady(1) == FALSE);
//        UARTSendDataByte(1, command[1]);
//
//        while(UARTTransmitterIsReady(1) == FALSE);
//        UARTSendDataByte(1, command[2]);
     
        
        return TRUE;
    }
    
    return FALSE;
}



// reverses a string 'str' of length 'len'
void reverse(char *str, int len)
{
    int i=0, j=len-1, temp;
    while (i<j)
    {
        temp = str[i];
        str[i] = str[j];
        str[j] = temp;
        i++; j--;
    }
}
 
 // Converts a given integer x to string str[].  d is the number
 // of digits required in output. If d is more than the number
 // of digits in x, then 0s are added at the beginning.
int intToStr(int x, char str[], int d)
{
    int istr[100];
    int i = 0;
    
    int xval = x;
    
