rollingstone/PIC32-Thermal-Controller/PeripheralSettingsAndMacros.c
    if(x < 0)
        x = -x;
    
//    if(x < 0)
//    {
//        str[i++] = '-';
//        x = -x;
//    }
//    
    while (x)
    {
        str[i++] = (x%10) + '0';
        x = x/10;
    }
 
    // If number of digits required is more, then
    // add 0s at the beginning
    while (i < d)
        str[i++] = '0';
 
    
    if(xval < 0)
    {
        str[i++] = '-';
    }
    
    reverse(str, i);
    str[i] = '\0';
    return i;
}
 
// Converts a floating point number to string.
void ftoa(float n, char *res, int afterpoint)
{
    // Extract integer part
    int ipart = (int)n;
 
    // Extract floating part
    float fpart;
    
    if(ipart < 0)
        fpart = (-n) - (-ipart);
    else
        fpart = n - ipart;
    
//    if(fpart < 0)
//        fpart = -fpart;
    
 
    // convert integer part to string
    int i = intToStr(ipart, res, 0);
 
    
    int order10 = 1;
    int ix = 0;
    
    while(ix++ < afterpoint)
        order10 *= 10;
    
    // check for display option after point
    if (afterpoint != 0)
    {
        res[i] = '.';  // add dot
 
        // Get the value of fraction part upto given no.
        // of points after dot. The third parameter is needed
        // to handle cases like 233.007
        fpart = fpart * order10;
 
        intToStr((int)fpart, res + i + 1, afterpoint);
    }
}



int SaveFloatDataToFlashMemory(float *data, int length, unsigned int offset /* values */)
{
    unsigned int * base_address = (unsigned int *)BASE_DATA_ADDRESS_NVM + offset;
   
    int idx = 0;
    
    if(length * 2 > (0xFFFF>>1) )
    {
        printf("ERROR: Buffer size must be smaller than 32K\n");
        return 0;
    }
    
    while(idx < length)
    {
        float val = data[idx];
        
        unsigned int ipart = (unsigned int) val;
        unsigned int fpart = 0;
        
        if(val >= 0)
        {
            fpart = (unsigned int) ((val - (int) val) * 1000.0);
        }
        else
        {
            float v2 = -val;
            fpart = (unsigned int) ((v2 - (int) v2) * 1000.0);
        }
        
        NVMWriteWord(base_address + 2*idx,  ipart);
        NVMWriteWord(base_address + (2*idx + 1),  fpart);

        idx++;
    }

    return 1;
}

int SaveInttDataToFlashMemory(unsigned int *data, int length, unsigned int offset /* values */)
{
    unsigned int * base_address = (unsigned int *)BASE_DATA_ADDRESS_NVM + offset;
   
    int idx = 0;
    
    if(length > (0xFFFF>>1) )
    {
        printf("ERROR: Buffer size must be smaller than 32K\n");
        return 0;
    }
    
    while(idx < length)
    {
        unsigned int val = data[idx];

        NVMWriteWord(base_address + idx,  val);

        idx++;
    }
    
    return 1;
}


int SaveIntFloatDataToFlashMemory(IntFloatValue *data, int length, unsigned int offset /* values */)
{
    unsigned int * base_address = (unsigned int *) BASE_DATA_ADDRESS_NVM + offset;
   
    int idx = 0;
    
    if(length > (0xFFFF >> 1) )
    {
        printf("ERROR: Buffer size must be smaller than 32K\n");
        return 0;
    }
    
    while(idx < length)
    {
        unsigned int val = data[idx].ivalue;

        NVMWriteWord(base_address + idx,  val);

        idx++;
    }
    
    return 1;
}


//int SaveIntFloatDataToFlashMemory(IntFloatValue *data, int length, unsigned int offset /* values */)
//{
//    unsigned int * base_address = (unsigned int *) BASE_DATA_ADDRESS_NVM + offset;
//   
//    int idx = 0;
//    
//    if(length > (0xFFFF >> 1) )
//    {
//        printf("ERROR: Buffer size must be smaller than 32K\n");
//        return 0;
//    }
//    
//    while(idx < length)
//    {
//        unsigned int val = data[idx].ivalue;
//
//        NVMWriteWord(base_address + idx,  val);
//
//        idx++;
//    }
//    
//    return 1;
//}

int LoadIntFloatDataFromFlashMemory(IntFloatValue *data, int length, unsigned int offset /* values */)
{
    unsigned int * base_address = (unsigned int *)BASE_DATA_ADDRESS_NVM + offset;
   
    int idx = 0;
    
    if(length > (0xFFFF>>1) )
    {
        printf("ERROR: Buffer size must be smaller than 32K\n");
        return 0;
    }
    
    while(idx < length)
    {
        data[idx].ivalue = *(base_address + idx);
        idx++;
    }
    
    return 1;
}



int LoadFloatDataFromFlashMemory(float *data, int length, unsigned int offset /* values */)
{
    unsigned int * base_address = (unsigned int *)BASE_DATA_ADDRESS_NVM + offset;
   
    int idx = 0;
    
    if(length * 2 > (0xFFFF>>1) )
    {
        printf("ERROR: Buffer size must be smaller than 32K\n");
        return 0;
    }
    
    while(idx < length)
    {
        int ipart = (int)*(base_address + 2*idx);
        int fpart = *(base_address + 2*idx + 1);
        
        if(ipart < 0)
        {
            data[idx] = (float)ipart - (float)fpart/1000.0;
        }
        else
        {
            data[idx] = (float)ipart + (float)fpart/1000.0;
        }
        
        idx++;
    }

    return 1;
}

void FloatToIntSplit(float data, int *int_part, int *float_part)
{
    int ipart = (int) data;
    int fpart = 0;
    
    if(ipart >= 0)
    {
        fpart = (int)((data - (float) ipart) * 1000.0); 
    }
    else
    {
        float d2 = -data;
        fpart = (int)((d2 - (float)((int) d2)) * 1000.0); 
    }
    
    *int_part = ipart;
    *float_part = fpart;
}

void ShowFloatData(float *data, int length)
{
    int i = 0;
    
    while(i < length)
    {
        int ipart;
        int fpart;
        
        FloatToIntSplit(data[i], &ipart, &fpart);
        
        printf("%d + %d/1000.0\n", ipart, fpart);
        i++;
    }
}


void WaitReadUART2()
{
    int val = 0;
    while(1)
    {
        
        if(DoReadUART2)
        {
            DoReadUART2 = FALSE;
            printf("UART2 RX Interrupt is called...\n");
            
        }
//        WAIT_AND_READ_FROM_UART2(val);
        while(U2STAbits.URXDA > 0)
        {
            val = U2RXREG;
        
            printf("Read data %d\n", val);
            WaitMS(1);
        }
    }
}


void __ISR( _UART_2_VECTOR, IPL3AUTO) _UART2RXInterrupt_(void)
{
    
    if(mU2RXGetIntFlag())
    {
    
        DoReadUART2  = TRUE;
    //    int val = U2RXREG;
    //    printf("Data Received...%c\n", (char) val);

//        int val =  U2RXRbits.U2RXR;
//        printf("UART 2 RX interrupt called....%d\n", val);


        mU2RXClearIntFlag();
    }
    else if(mU2TXGetIntFlag())
    {
        mU2TXClearIntFlag();
    }
    else if(mU2EGetIntFlag())
    {
        mU2EClearIntFlag();
    }
}


void *AllocateMaxPossibleMemory(uint32_t *data_length)
{
    void * buffer = NULL;
    
    while(*data_length > 0)
    {
        buffer = malloc((size_t) *data_length);
        
