rollingstone/PIC32-Thermal-Controller/PeripheralSettingsAndMacros.c
        if(buffer == NULL)
        {
            *data_length -= 1;
        }
        else
        {
            printf("%d KB (%d bytes) memory allocated\n", *data_length/1024, *data_length);
            return buffer;
        }
    }
    
    printf("Failed to allocate memory...\n");

    return NULL;
}


void GetCurrentTime(int *sec, int *ms)
{
    time_t tm;
    
//    tm = time(NULL);
    
    
}


void ReadSPI1Slave_test()
{
//    InitSPI1Slave();
    char str[100] = "Hello World\n";
    
    SpiChnEnable(SPI_CHANNEL1, 0);
//    SpiChnConfigure(SPI_CHANNEL2, (SpiConfigFlags)(SPI_CONFIG_MSSEN |SPI_CONFIG_SSEN|  SPI_CONFIG_MODE8 | SPI_CONFIG_ON));
//    SpiChnConfigure(SPI_CHANNEL2, (SpiConfigFlags)(SPI_CONFIG_SSEN |  SPI_CONFIG_MODE8 | SPI_CONFIG_CKP_HIGH | SPI_CONFIG_CKE_REV | SPI_CONFIG_ON));
//    SpiChnConfigure(SPI_CHANNEL2, (SpiConfigFlags)(SPI_CONFIG_MSSEN |SPI_CONFIG_SSEN |  SPI_CONFIG_MODE8 | SPI_CONFIG_CKE_REV | SPI_CONFIG_CKP_HIGH | SPI_CONFIG_DISSDO | SPI_CONFIG_ON));

//    SpiChnConfigure(SPI_CHANNEL1, (SpiConfigFlags)(SPI_CONFIG_CKE_REV | SPI_CONFIG_MODE8 | SPI_CONFIG_ON));
    SpiChnConfigure(SPI_CHANNEL1, (SpiConfigFlags)(SPI_CONFIG_MSSEN | SPI_CONFIG_CKE_REV | SPI_CONFIG_MODE8 | SPI_CONFIG_ON));

//    SpiChnSetBrg(SPI_CHANNEL2, brate);
    SpiChnEnable(SPI_CHANNEL1, 1);

    SPI1CONbits.ON = 1;

    int data = 0;
    int count = 0;
    while(1)
    {
        printf("%d: Reading  \n", count);
//        SpiChnPutC(SPI_CHANNEL1, 0xAA);
        data  = SpiChnGetC(SPI_CHANNEL1);
        
        int k=0; while(k++ < 1000);
        
        SpiChnPutC(SPI_CHANNEL1, 0b10111011); // 0b10111011 = 187
        
        printf("%d: %d\n", count, data);
        count++;
        count %= 256;
    }
    
}



void ReadSPI2Slave_test()
{
    
    SpiChnEnable(SPI_CHANNEL2, 0);
//    SpiChnConfigure(SPI_CHANNEL2, (SpiConfigFlags)(SPI_CONFIG_MSSEN |SPI_CONFIG_SSEN|  SPI_CONFIG_MODE8 | SPI_CONFIG_ON));
//    SpiChnConfigure(SPI_CHANNEL2, (SpiConfigFlags)(SPI_CONFIG_SSEN |  SPI_CONFIG_MODE8 | SPI_CONFIG_CKP_HIGH | SPI_CONFIG_CKE_REV | SPI_CONFIG_ON));
//    SpiChnConfigure(SPI_CHANNEL2, (SpiConfigFlags)(SPI_CONFIG_MSSEN |SPI_CONFIG_SSEN |  SPI_CONFIG_MODE8 | SPI_CONFIG_CKE_REV | SPI_CONFIG_CKP_HIGH | SPI_CONFIG_DISSDO | SPI_CONFIG_ON));

//    SpiChnConfigure(SPI_CHANNEL1, (SpiConfigFlags)(SPI_CONFIG_CKE_REV | SPI_CONFIG_MODE8 | SPI_CONFIG_ON));
    SpiChnConfigure(SPI_CHANNEL2, (SpiConfigFlags)(SPI_CONFIG_CKE_REV | SPI_CONFIG_MODE8 | SPI_CONFIG_ON));

//    SpiChnSetBrg(SPI_CHANNEL2, brate);
    SpiChnEnable(SPI_CHANNEL2, 1);
    SPI2CONbits.ON = 1;

    WaitMS(1);
    
    int data = 0;
    int count = 0;
    while(1)
    {
//        if(SPI2STATbits.SPIRBF == 0)
//        {
////            printf("Buffer is empty...\n  ");
//            continue;
//        }
        
        printf("%d: Reading...  ", count);
//        SpiChnPutC(SPI_CHANNEL1, 0xAA);
        data  = SpiChnGetC(SPI_CHANNEL2);
        SpiChnPutC(SPI_CHANNEL2, data); // 0b10111011 = 187
//        SpiChnPutC(SPI_CHANNEL2, 0b10111011); // 0b10111011 = 187

        int dummy = SPI2BUF;
        
        if(data == 0xFF)
        {
            break;
        }
        
        printf("rx %d\n", count, data);
        count++;
        count %= 256;
        WaitMS(1);

    }
    
}


void TestSPI1_Master()
{
    int data[2];
    
    
    while(1)
    {
        SpiChnPutC(SPI_CHANNEL1, 0);
        data[0] = SpiChnGetC(SPI_CHANNEL1);
        
        SpiChnPutC(SPI_CHANNEL1, 0);
        data[0] = SpiChnGetC(SPI_CHANNEL1);
        
        int32_t  value = ((data[0] << 8) | data[1]) & 0xFFFF;
        int32_t  vi = (value >> 2);
        
        printf("Value obtained %d, [%d, %d]\n", vi, (int)data[0], (int)data[1]);
        WaitMS(1);

    }
}


void Test_SPI2Slave_DataTransfer()
{
        int test_buffer_length = 100;//15480;
        UInt16Value *test_buffer = NULL;
 
        test_buffer = (UInt16Value  *) AllocateMaxPossibleMemory(&test_buffer_length);

        if(test_buffer == NULL)
        {
            printf("ERROR: Cannot allocate memory \n");
            return;
        }
//        else
//        {
//            printf("Allocated memory size %d\n", test_buffer_length);
//        }
 
        int i =0;
        int count  = 0;
        
        for(i = 0; i < test_buffer_length/2; i++)
        {
            int uval = count &0xFF00;
            int lval = count & 0xFF;
            test_buffer[i].v.upper = i+1;
            test_buffer[i].v.lower = i+1+10;
            
        }
        
        int data_tx_count = 0;
        
        while(1)
        {        
        SpiChnEnable(SPI_CHANNEL2, 0);
//    SpiChnConfigure(SPI_CHANNEL2, (SpiConfigFlags)(SPI_CONFIG_MSSEN |SPI_CONFIG_SSEN|  SPI_CONFIG_MODE8 | SPI_CONFIG_ON));
//    SpiChnConfigure(SPI_CHANNEL2, (SpiConfigFlags)(SPI_CONFIG_SSEN |  SPI_CONFIG_MODE8 | SPI_CONFIG_CKP_HIGH | SPI_CONFIG_CKE_REV | SPI_CONFIG_ON));
//    SpiChnConfigure(SPI_CHANNEL2, (SpiConfigFlags)(SPI_CONFIG_MSSEN |SPI_CONFIG_SSEN |  SPI_CONFIG_MODE8 | SPI_CONFIG_CKE_REV | SPI_CONFIG_CKP_HIGH | SPI_CONFIG_DISSDO | SPI_CONFIG_ON));

//    SpiChnConfigure(SPI_CHANNEL1, (SpiConfigFlags)(SPI_CONFIG_CKE_REV | SPI_CONFIG_MODE8 | SPI_CONFIG_ON));
        SpiChnConfigure(SPI_CHANNEL2, (SpiConfigFlags)(SPI_CONFIG_CKE_REV | SPI_CONFIG_MODE8 | SPI_CONFIG_ON));

//    SpiChnSetBrg(SPI_CHANNEL2, brate);
        SpiChnEnable(SPI_CHANNEL2, 1);

        SPI2CONbits.ON = 1;

        WaitMS(1);
        
        int vv;

//            if (test_buffer_length >= test_buffer_length)
//                continue;

            i = 0;

            printf("Data Transfer started\n");
        
            int is_first = 1;

//            SpiChnPutC(SPI_CHANNEL2, test_buffer[0].v.upper);
//            int tv = SPI2BUF; 
            
            while(i < test_buffer_length/2)
            {
                
                int val  = SpiChnGetC(SPI_CHANNEL2);
                
                if(is_first == 1)
                {
                    is_first = 0;
//                    mPORTASetBits(BIT_0 | BIT_1);
                }
                SpiChnPutC(SPI_CHANNEL2, test_buffer[i].v.upper);
                int tmp = SPI2BUF; // clear SPI2READ buffer
 
//                vv = 0; while(vv++ < 100);
 
                val  = SpiChnGetC(SPI_CHANNEL2);
                SpiChnPutC(SPI_CHANNEL2, test_buffer[i].v.lower);
                tmp = SPI2BUF;
               
                test_buffer_length += 2;
                

//                vv = 0; while(vv++ < 100);

    //            printf("upper %d   lower %d\n", (int)test_buffer[i].v.upper, (int) test_buffer[i].v.lower);
                i++;
            }

            SpiChnClose(SPI_CHANNEL2);
//            mPORTAClearBits(BIT_0 | BIT_1);
            printf("Data Transfer finished\n");
        }
    
        free(test_buffer);
}


void Test_SPI2Slave_DataTransferWithUART2()
{
        int test_buffer_length = 100;//15480;
        UInt16Value *test_buffer = NULL;
 
