rollingstone/PIC32-Thermal-Controller/PeripheralSettingsAndMacros.c
                printf("Data Transfer finished\n");

            }
        }

//        SpiChnClose(SPI_CHANNEL2);
//            mPORTAClearBits(BIT_0 | BIT_1);
        
        free(test_buffer);
}


int SendDataBySPI2Slave(UInt16Value *data, int data_length_in_bytes)
{
    int i = 0;
    int word_len = data_length_in_bytes >> 1;
    
    int val, dummy;

    printf("Sending %d bytes of data\n", data_length_in_bytes);

    int wait_count = 0;
    int do_stop_waiting = 0;
    
    for(i = 0; i < word_len; i++)
    {
        val = SpiChnGetC(SPI_CHANNEL2);
        SpiChnPutC(SPI_CHANNEL2, (unsigned int)data[i].v.upper);
        dummy = SPI2BUF;
        
        if(val == 0xFF)
        {
            break;
        }
        
        val = SpiChnGetC(SPI_CHANNEL2);
        SpiChnPutC(SPI_CHANNEL2, (unsigned int) data[i].v.lower);
        dummy = SPI2BUF;
        
        if(val == 0xFF)
        {
            break;
        }
    }

    printf("***  %d bytes SENT  ***\n", i*2);

    while(SPI2STATbits.SPIRBF) // clean up read buffer
    {
        dummy = SPI2BUF;
    }
    
    
    // it seems to help... flushes all the states,... not sure why is it even necessary
    SPI2CONbits.ON = 0;
//    WaitMS(10);
    SPI2CONbits.ON = 1;
    
    return i*2;
}


inline BOOL SPI2SlaveReadWithTimeOut(int *data, int time_out_loop)
{
    int wait_count = 0;
    while(!SPI2STATbits.SPITBF)
    {
        if(wait_count++ > time_out_loop)
        {
            return FALSE; // timeout
        }
    }
    
    *data = SPI2BUF;
    return TRUE; // Normal read
}


int SendDataBySPI2SlaveWithTimeOut(UInt16Value *data, int data_length_in_bytes, int time_out_delay)
{
    int i = 0;
    int word_len = data_length_in_bytes >> 1;
    
    int val, dummy;

    printf("Sending %d bytes of data\n", data_length_in_bytes);

    int wait_count = 0;
    BOOL do_stop_waiting = FALSE;
    
//    int time_out_delay = 10000;
    
    for(i = 0; i < word_len; i++)
    {
        if(SPI2SlaveReadWithTimeOut(&val, time_out_delay) == FALSE)
        {
            break;
        }

        SPI2BUF = data[i].v.upper;
        while(SPI2STATbits.SPITBF);
        dummy = SPI2BUF;
        
        if(val == 0xFF)
        {
            break;
        }
        
        if(SPI2SlaveReadWithTimeOut(&val, time_out_delay) == FALSE)
        {
            break;
        }

        SPI2BUF = data[i].v.lower;
        while(SPI2STATbits.SPITBF);
        dummy = SPI2BUF;
        
        if(val == 0xFF)
        {
            break;
        }
    }

    printf("***  %d bytes SENT  ***\n", i*2);

    while(SPI2STATbits.SPIRBF) // clean up read buffer
    {
        dummy = SPI2BUF;
    }
    
    
    // it seems to help... flushes all the states,... not sure why is it even necessary
    SPI2CONbits.ON = 0;
//    WaitMS(10);
    SPI2CONbits.ON = 1;
    
    return i*2;
}



void TestUART2()
{
    int count = 0;
    int tx = 50;

    printf("Reading UART2...\n");
//    InitUART2();
    
    while(1)
    {
        if(U2STAbits.URXDA)
        {
            int val = (int) UARTGetDataByte(1); // UART2
            
//            printf("%d:   UART2 read value %d\n", count++, val);

//            printf("%d:   Writing to UART2 %d\n", (int) tx);
            
            WRITE_TO_UART2(tx);
            
            tx += 15;
            tx %= 256;
        }
    }
}



void TestUART1DataReadWrite()
{
   int count = 0;
    int tx = 10;

    while(1)
    {
//        printf("%d:\tThis is a test...\n", count++);
//        
//        int k = 0; while(k++ < 1000)
//        {
//            asm("nop");
//        }
        
        
        if(U1STAbits.URXDA)
        {
            int val = (int) UARTGetDataByte(0); // UART2
            
//            printf("%d:   Writing to UART1 %d\n", (int) tx);
            
            tx = val;
            WRITE_TO_UART1(tx);
            printf("%d:   UART1 read value %d \t Writing to UART1 %d\n", count++, val, (int)tx);
            
            tx += 15;
            tx %= 256;
            
            int kk = 0; while(kk++ < (1<< 20));
        }

        
    }
}



void TestSPi2Slave()
{
    
    
        SpiChnEnable(SPI_CHANNEL2, 0);
//    SpiChnConfigure(SPI_CHANNEL2, (SpiConfigFlags)(SPI_CONFIG_MSSEN |SPI_CONFIG_SSEN|  SPI_CONFIG_MODE8 | SPI_CONFIG_ON));
//    SpiChnConfigure(SPI_CHANNEL2, (SpiConfigFlags)(SPI_CONFIG_SSEN |  SPI_CONFIG_MODE8 | SPI_CONFIG_CKP_HIGH | SPI_CONFIG_CKE_REV | SPI_CONFIG_ON));
//    SpiChnConfigure(SPI_CHANNEL2, (SpiConfigFlags)(SPI_CONFIG_MSSEN |SPI_CONFIG_SSEN |  SPI_CONFIG_MODE8 | SPI_CONFIG_CKE_REV | SPI_CONFIG_CKP_HIGH | SPI_CONFIG_DISSDO | SPI_CONFIG_ON));

//    SpiChnConfigure(SPI_CHANNEL1, (SpiConfigFlags)(SPI_CONFIG_CKE_REV | SPI_CONFIG_MODE8 | SPI_CONFIG_ON));
        SpiChnConfigure(SPI_CHANNEL2, (SpiConfigFlags)(SPI_CONFIG_CKE_REV | SPI_CONFIG_MODE8 | SPI_CONFIG_ON));

//    SpiChnSetBrg(SPI_CHANNEL2, brate);
        SpiChnEnable(SPI_CHANNEL2, 1);
        
        SPI2CONbits.ON = 1;
    
        int i = 0;
        int tmp = 0;
        int data_length = 100;
   
        
        while(1)
        {
//            SPI2CONbits.ON = 1;
            printf("Waiting to send %d bytes of data\n", data_length);
            for(i = 0; i < data_length/2; i++)
            {
                int val  = SpiChnGetC(SPI_CHANNEL2);
                SpiChnPutC(SPI_CHANNEL2, i+1);
                tmp = SPI2BUF;
                
                if(val == 0xFF)
                {
                    printf("val == %d, Exiting SPI2 read loop\n", val);
                    break;
                }
                
                int v = 0; while(v++ < 10);
                
                val  = SpiChnGetC(SPI_CHANNEL2);
                SpiChnPutC(SPI_CHANNEL2, i+1+10);
                tmp = SPI2BUF;
                
                if(val  == 0xFF)
                {
                    printf("2nd level val == %d, Exiting SPI2 read loop\n", val);
                    break;
                }

                
//                printf(" i = %d\n", i);
            }
            
//            printf("%i == d\n", i);
            
