rollingstone/PIC32-Thermal-Controller/PeripheralSettingsAndMacros.c
         SPI2CleanReadBuffer();
       
 //
//        SPI2CONbits.ON = 1;
        
//        return
//        idx = 0;
    //        printf("%d\n", rx0);
    }
    
    while(1)
    {
//        if(SPI2STATbits.SPIRBF)
//            printf("SPI2STATbits.SPITBF is TRUE\t");
//        else
//            printf("SPI2STATbits.SPITBF is FALSE\t");
        
//        if(!SPI2STATbits.SPIRBE)
//            printf("SPI2STATbits.SPIRBE is Empty\t");
//        else
//            printf("SPI2STATbits.SPIRBE is NOT empty\t");
//
//        WaitMS(1);

        int data = SPI2_SLAVE_READ();
//        SpiChnPutC(SPI_CHANNEL2,data);
        int d2 = data+5;
        SPI2_SLAVE_WRITE(5, dummy);

        printf(" %d \n ", data);
        
//        buffer[idx] = data;
        
//        if(idx > 4)
//        {
//            int k = 0;
//            while(k < idx)
//            {
//                printf(" %d \n ", buffer[k]);
//                
//            }
//            idx = -1;
//         }
//        
//        idx++;
//        
//        if(idx > 50)
            break;
//        printf(" %d \n ", data);
        //WaitMS(1);
        
    }
    
    int j = 0;
    while(j < idx)
    {
        printf(" %d   \n", buffer[j]);
        j++;
    }
    
    return ;
    
    while(1)
    {
        idx = 0;
        
        if(1)
        {
            while(idx < max_command_len)
            {
                command[idx] = SPI2_SLAVE_READ();
                SPI2_SLAVE_WRITE(0, dummy);
                idx++;
                
                SPI2CONbits.ON = 0;
                SPI2CONbits.ON = 1;
                
            }
    
            if(idx == 3)
            {
                int k = 0;
                while(k++ < max_command_len)
                {
                    printf("  %d  ", command[k]);
                }
                printf("\n");
            }

        }
    }
    
    
}